var emoticonOriginals = [

  "( ︶︿︶)_╭∩╮",
  "( ￣ c￣)y▂ξ",
  "( ′-`)y-～",
  "( ‵□′)───C＜─___-)|||",
  "(#‵′)凸",
  "(．＿．?)",
  "(／‵′)／~ ╧╧",
  "(？o？)",
  "(－^－)ｄ",
  "(~^O^~)",

  "(¯(∞)¯)",
  "(￣￣；)",
  "(￣□￣|||)a",
  "(￣▽￣＃)﹏﹏",
  "(￣ε(#￣) #○=(一-一o)",
  "(⊙o⊙)",
  "(=‵′=)",
  "(∩_∩)",
  "(≧<>≦)",
  "(●；－_－)●",

  "(╭∩╮\\_/╭∩╮)",
  "(☆_☆)",
  "(o一-一)=○# (￣#)3￣)",
  "(‧Q‧)",
  "..╮(﹋﹏﹌)╭..",
  "﹨(╯▽╰)∕",
  "\\(@^0^@)/",
  "\\(^▽^)/",
  "\\⊙▽⊙/",
  "ˋ(′_‵||)ˊ",

  "ˋ(O_O)ˋ~═╦════╦═",
  "￣▽￣||",
  "~(￣▽￣)~(＿△＿)~(￣▽￣)~(＿△＿)~(￣▽￣)~",
  "︿(￣︶￣)︿",
  "︾︽︾︵∩︵",
  "<(￣︶￣)>",
  "●( ¯▽¯；●",
  "○(#‵︿′ㄨ)○",
  "╭ ﹀◇﹀〣",
  "╭(─╴╴─)╮ ▃▇",

  "╮(′～‵〞)╭",
  "╮(﹀_﹀\")╭",
  "┐(─＿─)┌",
  "╮(╯_╰)╭",
  "╮(╯▽╰)/",
  "╮(╯◇╰)╭",
  "╰(‵皿′＊)╯",
  "╯-____-)╯~═╩════╩═~",
  "〒△〒",
  "ｂ（￣︿￣）ｄ",

  "m川@.川m",
  "o(‧\"‧)o",
  "o(＞＜；)o o",
  "o(一︿一+)o",
  "o-_-)=O)。O。)",
  "v(￣︶￣)y",
  "(ノ ゜Д゜)ノ ︵ ═╩════╩═",
  "(σ′▽‵)′▽‵)σ 哈哈哈哈～你看看你",
  "′_>‵",

];

function Emoticon() {
  this.listNode = document.getElementById('emoticonList');
  this.setupListOnUi();
}

Emoticon.prototype.setupListOnUi = function() {
  var htmlStr = '';
  for (var i = 0; i < 10; ++i) {
    var e = emoticonOriginals[i];
    htmlStr += '<li>'+e+'</li>';
  }
  this.listNode.innerHTML = htmlStr;
};

Emoticon.prototype.showList = function() {
};

Emoticon.prototype.loadText = function() {
};
